1_3_post_mods/modules/integration/manual/itest-resources/interop/whitemesa/round3/sunGDRpcStructArrayRes.xml

<?xml version='1.0' encoding='utf-8'?><!--
  ~ Licensed to the Apache Software Foundation (ASF) under one
  ~ or more contributor license agreements. See the NOTICE file
  ~ distributed with this work for additional information
  ~ regarding copyright ownership. The ASF licenses this file
  ~ to you under the Apache License, Version 2.0 (the
  ~ "License"); you may not use this file except in compliance
  ~ with the License. You may obtain a copy of the License at
  ~
  ~ http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied. See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://soapinterop.org/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://soapinterop/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:s="http://soapinterop.org/xsd"><soapenv:Body><ns1:echoStructArray soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><inputArray xmlns="" xsi:type="SOAP-ENC:Array" SOAP-ENC:arrayType="s:SOAPStruct[3]"><item0><varString xsi:type="xsd:string">strss fdfing1</varString><varInt xsi:type="xsd:int">25</varInt><varFloat xsi:type="xsd:float">25.23</varFloat></item0><item0><varString xsi:type="xsd:string">strss fdfing1</varString><varInt xsi:type="xsd:int">25</varInt><varFloat xsi:type="xsd:float">25.23</varFloat></item0><item0><varString xsi:type="xsd:string">strss fdfing1</varString><varInt xsi:type="xsd:int">25</varInt><varFloat xsi:type="xsd:float">25.23</varFloat></item0></inputArray></ns1:echoStructArray></soapenv:Body></soapenv:Envelope>
